import React from "react";

const CartOpinion=()=>{
    return(
        <React.Fragment>
            <div className="flex flex-col gap-2 my-5 p-2 w-full shadow-lg dark:shadow-2xl rounded-md">
                <div className="flex justify-between items-center">
                    {/* نام کاربر */}
                    <p className="text-[14px] dark:text-gray-300">
                        کاربر ناشناس
                    </p>
                    {/* تاریخ */}
                    <p className="text-[14px] text-gray-500 w-max px-2">
                        ۱۴۰۴/۸/۲۸
                    </p>
                </div>
                {/* ستاره ها */}
                <div className="mr-auto">
                    <div className="flex flex-row">
                        <svg fill="currentColor" viewBox="0 0 20 20" className="h-4 w-4 text-yellow-400" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.049 2.927c.3-.916 1.603-.916 1.902 0l1.286 3.953a1.5 1.5 0 001.421 1.033h4.171c.949 0 1.341 1.154.577 1.715l-3.38 2.458a1.5 1.5 0 00-.54 1.659l1.286 3.953c.3.916-.757 1.67-1.539 1.145l-3.38-2.458a1.5 1.5 0 00-1.76 0l-3.38 2.458c-.782.525-1.838-.229-1.539-1.145l1.286-3.953a1.5 1.5 0 00-.54-1.659l-3.38-2.458c-.764-.561-.372-1.715.577-1.715h4.171a1.5 1.5 0 001.421-1.033l1.286-3.953z"></path>
                        </svg>
                        <svg fill="currentColor" viewBox="0 0 20 20" className="h-4 w-4 text-yellow-400" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.049 2.927c.3-.916 1.603-.916 1.902 0l1.286 3.953a1.5 1.5 0 001.421 1.033h4.171c.949 0 1.341 1.154.577 1.715l-3.38 2.458a1.5 1.5 0 00-.54 1.659l1.286 3.953c.3.916-.757 1.67-1.539 1.145l-3.38-2.458a1.5 1.5 0 00-1.76 0l-3.38 2.458c-.782.525-1.838-.229-1.539-1.145l1.286-3.953a1.5 1.5 0 00-.54-1.659l-3.38-2.458c-.764-.561-.372-1.715.577-1.715h4.171a1.5 1.5 0 001.421-1.033l1.286-3.953z"></path>
                        </svg>
                        <svg fill="currentColor" viewBox="0 0 20 20" className="h-4 w-4 text-yellow-400" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.049 2.927c.3-.916 1.603-.916 1.902 0l1.286 3.953a1.5 1.5 0 001.421 1.033h4.171c.949 0 1.341 1.154.577 1.715l-3.38 2.458a1.5 1.5 0 00-.54 1.659l1.286 3.953c.3.916-.757 1.67-1.539 1.145l-3.38-2.458a1.5 1.5 0 00-1.76 0l-3.38 2.458c-.782.525-1.838-.229-1.539-1.145l1.286-3.953a1.5 1.5 0 00-.54-1.659l-3.38-2.458c-.764-.561-.372-1.715.577-1.715h4.171a1.5 1.5 0 001.421-1.033l1.286-3.953z"></path>
                        </svg>
                        <svg fill="currentColor" viewBox="0 0 20 20" className="h-4 w-4 text-yellow-400" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.049 2.927c.3-.916 1.603-.916 1.902 0l1.286 3.953a1.5 1.5 0 001.421 1.033h4.171c.949 0 1.341 1.154.577 1.715l-3.38 2.458a1.5 1.5 0 00-.54 1.659l1.286 3.953c.3.916-.757 1.67-1.539 1.145l-3.38-2.458a1.5 1.5 0 00-1.76 0l-3.38 2.458c-.782.525-1.838-.229-1.539-1.145l1.286-3.953a1.5 1.5 0 00-.54-1.659l-3.38-2.458c-.764-.561-.372-1.715.577-1.715h4.171a1.5 1.5 0 001.421-1.033l1.286-3.953z"></path>
                        </svg>
                        <svg fill="currentColor" viewBox="0 0 20 20" className="h-4 w-4 text-yellow-200" xmlns="http://www.w3.org/2000/svg">
                        <path d="M9.049 2.927c.3-.916 1.603-.916 1.902 0l1.286 3.953a1.5 1.5 0 001.421 1.033h4.171c.949 0 1.341 1.154.577 1.715l-3.38 2.458a1.5 1.5 0 00-.54 1.659l1.286 3.953c.3.916-.757 1.67-1.539 1.145l-3.38-2.458a1.5 1.5 0 00-1.76 0l-3.38 2.458c-.782.525-1.838-.229-1.539-1.145l1.286-3.953a1.5 1.5 0 00-.54-1.659l-3.38-2.458c-.764-.561-.372-1.715.577-1.715h4.171a1.5 1.5 0 001.421-1.033l1.286-3.953z"></path>
                        </svg>
                    </div>
                </div>
                {/* متن */}
                <div className="text-blue-500 text-[16px] my-2">
                    <p>
                        ممنون بابت کالای اصل تحویل به موقع و بسته بندی عالی
                    </p>
                </div>
            </div>

        </React.Fragment>
    )
}

export default CartOpinion